[
  {
    "slug": "portfolio-website",
    "title": "1. Portfolio Website with Markdown Content System",
    "description": "A vanilla JavaScript portfolio with custom markdown-based content management, built the hard way because I refused to learn Jekyll.",
    "tags": [
      "css",
      "js",
      "html",
      "markdown",
      "github",
      "node"
    ],
    "demo": "https://tianpretorius.github.io",
    "github": "https://github.com/tian102/tianpretorius.github.io",
    "image": "https://images.unsplash.com/photo-1487017159836-4e23ece2e4cf?w=1200&h=630&fit=crop",
    "coverImage": "https://images.unsplash.com/photo-1487017159836-4e23ece2e4cf?w=1200&h=630&fit=crop",
    "date": "2024-10-09",
    "content": "\r\n# Portfolio Website with Markdown Content System\r\n\r\n## Reinventing the Wheel\r\n\r\nI built this portfolio the hard way—no frameworks, no backend, no Jekyll—just Node.js, vanilla JavaScript, and a stubborn streak. Every markdown file, asset, and route is handled by a custom system I wrote myself. Sure, it took a bunch of hours to do what a few commands in Jekyll could’ve done, but along the way I learned everything about build automation, client-side routing, and modular site design—and now I have a portfolio that’s annoyingly mine.\r\n\r\n![Cover Image](https://images.unsplash.com/photo-1487017159836-4e23ece2e4cf?w=1200&h=630&fit=crop)\r\n\r\n## Project Overview\r\n\r\nThis portfolio was born from necessity (needing a place to showcase my work) and fueled by stubbornness (refusing to do things the easy way).\r\n\r\nGitHub Pages offers a fantastic tool called Jekyll that makes working with markdown files incredibly straightforward. It's mature, well-documented, and used by thousands of developers.\r\n\r\nI chose not to use it.\r\n\r\nWhy? Because learning \"just another tool\" felt like an investment of time I wasn't willing to make. Instead, I decided to reinvent the wheel—spending 10+ hours building a custom system to automate what I could have done with Jekyll in an afternoon.\r\n\r\nClassic developer move, right?\r\n\r\nBut in the process, I learned a lot, built something that's truly mine, and ended up with a portfolio system that works exactly the way I want it to.\r\n\r\n## Key Features\r\n\r\n- **Markdown-Based Content Management**: Write blog posts and project descriptions in markdown, complete with frontmatter for metadata\r\n- **Automated Build System**: Node.js script that parses markdown files and generates JSON data at build time\r\n- **Modular Directory Structure**: Each post lives in its own directory with dedicated assets folder for images and resources\r\n- **Client-Side Routing**: Dynamic navigation using the History API, no page reloads needed\r\n- **Zero Backend Dependencies**: Everything is statically generated and served, keeping hosting costs at exactly $0\r\n- **Responsive Design**: Mobile-first approach with smooth animations and transitions\r\n\r\n## Technology Stack\r\n\r\n### Frontend\r\n- **Vanilla JavaScript**: No frameworks—just pure JS for maximum control and minimal bundle size\r\n- **HTML5 & CSS3**: Semantic markup with modern CSS features (custom properties, grid, flexbox)\r\n- **marked.js**: Markdown parsing library for converting content to HTML\r\n\r\n### Content Management\r\n- **Markdown with Frontmatter**: Write content in markdown files with YAML metadata\r\n- **Modular Structure**: Each post in its own directory (`content/blog/posts/post-name/index.md`)\r\n- **Asset Organization**: Images and resources stored alongside their content in `assets/` subdirectories\r\n\r\n### Build System\r\n- **Node.js Script**: Custom build pipeline that:\r\n  - Scans content directories for markdown files\r\n  - Parses frontmatter and content\r\n  - Generates structured JSON data files\r\n  - Processes image paths and metadata\r\n- **GitHub Actions**: Automated builds on push that regenerate content JSON\r\n\r\n### Hosting & Deployment\r\n- **GitHub Pages**: Free static hosting with custom domain support\r\n- **Git-Based Workflow**: Push to main branch triggers automatic deployment\r\n\r\n## Architecture & Design Decisions\r\n\r\n### Why Vanilla JavaScript Over Frameworks?\r\n\r\nFor a portfolio site, frameworks felt like overkill. The performance overhead, build complexity, and learning curve didn't justify the benefits. With vanilla JS, I got:\r\n- ~50KB total JavaScript (unminified)\r\n- Sub-100ms page transitions\r\n- Complete control over every interaction\r\n- No build step for the frontend (just for content)\r\n\r\n### The Jekyll Stubbornness Story\r\n\r\nGitHub Pages has built-in Jekyll support. It's designed for exactly this use case—turning markdown files into websites. It handles frontmatter, templating, and asset management automatically.\r\n\r\nBut I didn't want to learn Ruby. I didn't want to configure another tool. I didn't want to deal with Liquid templates.\r\n\r\nSo instead, I built my own system in Node.js that:\r\n1. Recursively scans content directories\r\n2. Reads markdown files and parses frontmatter\r\n3. Extracts metadata (title, date, tags, etc.)\r\n4. Generates clean JSON data structures\r\n5. Handles asset paths and images\r\n\r\nWas this necessary? Absolutely not.\r\n\r\nDid it take longer than learning Jekyll? Probably.\r\n\r\nDo I regret it? Not really. I learned a ton about file systems, markdown parsing, and build automation. Plus, I now have a system that works exactly how I want it to, with no magic happening behind the scenes.\r\n\r\n### Modular Content Structure\r\n\r\nOne thing I did get right: the directory structure. Each blog post and project lives in its own folder:\r\n\r\n```\r\ncontent/\r\n├── blog/\r\n│   └── posts/\r\n│       └── my-post/\r\n│           ├── index.md\r\n│           └── assets/\r\n│               └── image.jpg\r\n└── projects/\r\n    └── posts/\r\n        └── my-project/\r\n            ├── index.md\r\n            └── assets/\r\n                └── screenshot.png\r\n```\r\n\r\nThis keeps content organized, makes assets easy to find, and means I can move posts around without breaking image paths.\r\n\r\n### Build Time vs Runtime\r\n\r\nI made a key decision early on: process content at build time, not runtime.\r\n\r\nInstead of fetching markdown files and parsing them in the browser, the build script pre-processes everything into JSON. This means:\r\n- Faster page loads (no parsing overhead)\r\n- Better SEO (content is available immediately)\r\n- Simpler client-side code\r\n- Clear separation between content and presentation\r\n\r\nThe trade-off? I have to run `npm run build` every time I add or update content. But with GitHub Actions, that's automated anyway.\r\n\r\n## Results & Outcomes\r\n\r\n### Performance\r\n- **JavaScript Bundle**: ~50KB unminified (could be smaller with minification)\r\n- **Page Load Time**: Sub-second for initial load\r\n- **Navigation Speed**: <100ms transitions between pages\r\n- **No Backend**: Zero server costs, no database overhead\r\n\r\n### Developer Experience\r\n- **Content Workflow**: Write markdown → Push to GitHub → Automatic build and deploy\r\n- **Easy Updates**: Just edit a markdown file, no need to touch code\r\n- **Asset Management**: Images live next to content, no path confusion\r\n- **Version Control**: Everything in git means full history and easy rollbacks\r\n\r\n### Learning Outcomes\r\n- **File System Operations**: Deep dive into Node.js fs module and recursive directory scanning\r\n- **Markdown Parsing**: Understanding frontmatter, AST parsing, and content extraction\r\n- **Build Automation**: Creating custom build pipelines and CI/CD integration\r\n- **History API**: Client-side routing without frameworks\r\n- **The Value of Existing Tools**: Sometimes the wheel doesn't need reinventing (but it's fun anyway)\r\n\r\n## Challenges & Lessons Learned\r\n\r\n### The Jekyll Realization\r\n\r\nAbout halfway through building my custom system, I realized Jekyll would have solved 90% of my problems out of the box. But by then, I was committed. And honestly? I learned more doing it the hard way.\r\n\r\nWould I recommend this approach to others? Probably not. But if you're the stubborn type who likes to understand every piece of the puzzle, building your own system is incredibly educational.\r\n\r\n### GitHub Pages Quirks\r\n\r\nGitHub Pages is great, but it has its peculiarities:\r\n- Deployment can be finicky if you don't understand the build process\r\n- Custom domains require specific DNS configuration\r\n- There's a learning curve to the Actions workflow\r\n- You're limited to static content (which was actually a good constraint)\r\n\r\n### The 10-Hour Automation Rule\r\n\r\nThere's a developer joke: \"I spent 10 hours automating a task that takes 2 minutes to do manually.\"\r\n\r\nThat's basically what I did here. Jekyll would have been the 2-minute solution. My custom build system was the 10-hour one.\r\n\r\nBut here's the thing: I don't regret it. Those 10 hours taught me things I wouldn't have learned otherwise. And now I have a portfolio that's uniquely mine.\r\n\r\n## 🚀 Future Improvements\r\n\r\n- **Search Functionality**: Add client-side search across blog posts and projects\r\n- **Tag Filtering**: Filter content by technology tags\r\n- **RSS Feed**: Generate an RSS feed for the blog\r\n- **Dark Mode**: Add theme toggle for dark mode support\r\n- **Performance Optimization**: Minify and bundle JavaScript\r\n- **Progressive Web App**: Add service worker for offline support\r\n\r\n## Key Takeaways\r\n\r\n1. **Constraints Drive Creativity**: Having no budget forced me to find free solutions and build creatively\r\n2. **Stubbornness Has Its Place**: Sometimes doing things the hard way teaches you more than the easy way\r\n3. **Ownership Matters**: Building my own system means I understand every piece of it\r\n4. **But Also**: Existing tools exist for a reason—don't always reinvent the wheel (even though I did)\r\n5. **Build What You Need**: This portfolio isn't perfect, but it's mine and it works\r\n\r\n---\r\n\r\n*Built with stubbornness, vanilla JavaScript, and way more custom code than was strictly necessary.*\r\n",
    "assetsPath": "content/projects/posts/portfolio-website/assets/",
    "projectPath": "content/projects/posts/portfolio-website/"
  }
]